{
  "format": "layers-model",
  "generatedBy": "keras v2.13.1",
  "convertedBy": "TensorFlow.js Converter v4.11.0",
  "modelTopology": {
    "keras_version": "2.13.1",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_24",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 100],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "embedding_24_input"
            }
          },
          {
            "class_name": "Embedding",
            "config": {
              "name": "embedding_24",
              "trainable": false,
              "dtype": "float32",
              "batch_input_shape": [null, 100],
              "input_dim": 39111,
              "output_dim": 300,
              "embeddings_initializer": {
                "module": "keras.initializers",
                "class_name": "RandomUniform",
                "config": { "minval": -0.05, "maxval": 0.05, "seed": null },
                "registered_name": null
              },
              "embeddings_regularizer": null,
              "activity_regularizer": null,
              "embeddings_constraint": null,
              "mask_zero": false,
              "input_length": 100
            }
          },
          {
            "class_name": "Bidirectional",
            "config": {
              "name": "bidirectional_29",
              "trainable": true,
              "dtype": "float32",
              "layer": {
                "module": "keras.layers",
                "class_name": "LSTM",
                "config": {
                  "name": "lstm_29",
                  "trainable": true,
                  "dtype": "float32",
                  "return_sequences": false,
                  "return_state": false,
                  "go_backwards": false,
                  "stateful": false,
                  "unroll": false,
                  "time_major": false,
                  "units": 64,
                  "activation": "tanh",
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "kernel_initializer": {
                    "module": "keras.initializers",
                    "class_name": "GlorotUniform",
                    "config": { "seed": null },
                    "registered_name": null
                  },
                  "recurrent_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Orthogonal",
                    "config": { "gain": 1.0, "seed": null },
                    "registered_name": null
                  },
                  "bias_initializer": {
                    "module": "keras.initializers",
                    "class_name": "Zeros",
                    "config": {},
                    "registered_name": null
                  },
                  "unit_forget_bias": true,
                  "kernel_regularizer": null,
                  "recurrent_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "recurrent_constraint": null,
                  "bias_constraint": null,
                  "dropout": 0.0,
                  "recurrent_dropout": 0.0,
                  "implementation": 2
                },
                "registered_name": null
              },
              "merge_mode": "concat"
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_29",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.5,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_23",
              "trainable": true,
              "dtype": "float32",
              "units": 5,
              "activation": "sigmoid",
              "use_bias": true,
              "kernel_initializer": {
                "module": "keras.initializers",
                "class_name": "GlorotUniform",
                "config": { "seed": null },
                "registered_name": null
              },
              "bias_initializer": {
                "module": "keras.initializers",
                "class_name": "Zeros",
                "config": {},
                "registered_name": null
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      }
    },
    "training_config": {
      "loss": "binary_crossentropy",
      "metrics": [
        [
          {
            "class_name": "MeanMetricWrapper",
            "config": {
              "name": "accuracy",
              "dtype": "float32",
              "fn": "categorical_accuracy"
            }
          }
        ]
      ],
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "Custom>Adam",
        "config": {
          "name": "Adam",
          "weight_decay": null,
          "clipnorm": null,
          "global_clipnorm": null,
          "clipvalue": null,
          "use_ema": false,
          "ema_momentum": 0.99,
          "ema_overwrite_frequency": null,
          "jit_compile": true,
          "is_legacy_optimizer": false,
          "learning_rate": 0.0010000000474974513,
          "beta_1": 0.9,
          "beta_2": 0.999,
          "epsilon": 1e-7,
          "amsgrad": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of12.bin",
        "group1-shard2of12.bin",
        "group1-shard3of12.bin",
        "group1-shard4of12.bin",
        "group1-shard5of12.bin",
        "group1-shard6of12.bin",
        "group1-shard7of12.bin",
        "group1-shard8of12.bin",
        "group1-shard9of12.bin",
        "group1-shard10of12.bin",
        "group1-shard11of12.bin",
        "group1-shard12of12.bin"
      ],
      "weights": [
        {
          "name": "bidirectional_29/forward_lstm_29/lstm_cell/kernel",
          "shape": [300, 256],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_29/forward_lstm_29/lstm_cell/recurrent_kernel",
          "shape": [64, 256],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_29/forward_lstm_29/lstm_cell/bias",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_29/backward_lstm_29/lstm_cell/kernel",
          "shape": [300, 256],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_29/backward_lstm_29/lstm_cell/recurrent_kernel",
          "shape": [64, 256],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_29/backward_lstm_29/lstm_cell/bias",
          "shape": [256],
          "dtype": "float32"
        },
        { "name": "dense_23/kernel", "shape": [128, 5], "dtype": "float32" },
        { "name": "dense_23/bias", "shape": [5], "dtype": "float32" },
        {
          "name": "embedding_24/embeddings",
          "shape": [39111, 300],
          "dtype": "float32"
        }
      ]
    }
  ]
}
